OpenQBMM_2.0.0/validation/pbeTransportFoam/serraTaylorCouette/165rpm/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.0e5;

boundaryField
{
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            calculated;
        value           $internalField;
    }
    outerWall
    {
        type            calculated;
        value           $internalField;
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
